Clash Bot Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot/runs/run-rfBJbkhjQfrQ146A

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available_zones: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
data.aws_availability_zones.available_zones: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.clash-bot-secret-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "clash-bot-secret-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::816923827429:role/clash-bot-discord-exec-role",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudwatch_log_group.clash-bot-task-logs will be created
  + resource "aws_cloudwatch_log_group" "clash-bot-task-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "clash-bot-discord-ecs-task-logs"
      + retention_in_days = 120
      + tags_all          = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
    }

  # aws_ecs_cluster.clash-bot-ecs will be created
  + resource "aws_ecs_cluster" "clash-bot-ecs" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "clash-bot-discord-ecs"
      + tags               = {
          + "Name" = "clash-bot-discord-ecs"
        }
      + tags_all           = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-ecs"
          + "Type"        = "Bot"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.clash-bot-discord-bot-service will be created
  + resource "aws_ecs_service" "clash-bot-discord-bot-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "clash-bot-discord-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "clash-bot-discord-ecs-service"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-ecs-service"
          + "Type"        = "Bot"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "clash-bot-discord"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.clash-bot-discord-bot-task-def will be created
  + resource "aws_ecs_task_definition" "clash-bot-discord-bot-task-def" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "clash-bot-discord"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "clash-bot-discord-task"
        }
      + tags_all                 = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-task"
          + "Type"        = "Bot"
        }
    }

  # aws_eip.clash-bot-eip-gateway[0] will be created
  + resource "aws_eip" "clash-bot-eip-gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "clash-bot-discord-eip"
        }
      + tags_all             = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-eip"
          + "Type"        = "Bot"
        }
      + vpc                  = true
    }

  # aws_eip.clash-bot-eip-gateway[1] will be created
  + resource "aws_eip" "clash-bot-eip-gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "clash-bot-discord-eip"
        }
      + tags_all             = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-eip"
          + "Type"        = "Bot"
        }
      + vpc                  = true
    }

  # aws_iam_policy.clash-bot-iam-policy will be created
  + resource "aws_iam_policy" "clash-bot-iam-policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "secrets-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
    }

  # aws_iam_policy.ecr_iam_policy will be created
  + resource "aws_iam_policy" "ecr_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecr-ecs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
    }

  # aws_iam_policy.ecr_registry_iam_policy will be created
  + resource "aws_iam_policy" "ecr_registry_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecr-ecs-registry-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
    }

  # aws_iam_policy.logs_iam_policy will be created
  + resource "aws_iam_policy" "logs_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs-logs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
    }

  # aws_iam_policy.secrets_iam_policy will be created
  + resource "aws_iam_policy" "secrets_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs-secrets-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
    }

  # aws_iam_role.clash-bot-exec-role will be created
  + resource "aws_iam_role" "clash-bot-exec-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-discord-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.clash_bot_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "clash_bot_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-discord-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-ecr-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ecr-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-discord-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-ecr-repository-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ecr-repository-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-discord-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-logs-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-logs-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-discord-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-secrets-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-secrets-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-discord-exec-role"
    }

  # aws_internet_gateway.gateway will be created
  + resource "aws_internet_gateway" "gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "clash-bot-discord-ig"
        }
      + tags_all = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-ig"
          + "Type"        = "Bot"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.clash-bot-discord-bot-lb will be created
  + resource "aws_lb" "clash-bot-discord-bot-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "clash-bot-discord-lb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "clash-bot-discord-lb"
        }
      + tags_all                   = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-lb"
          + "Type"        = "Bot"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.clash-bot-discord-bot-lb-listener will be created
  + resource "aws_lb_listener" "clash-bot-discord-bot-lb-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.clash-bot-discord-bot-tg will be created
  + resource "aws_lb_target_group" "clash-bot-discord-bot-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "clash-bot-discord-tg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "clash-bot-discord-ecs-tg"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-ecs-tg"
          + "Type"        = "Bot"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_nat_gateway.clash-bot-gateway[0] will be created
  + resource "aws_nat_gateway" "clash-bot-gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "clash-bot-discord-nat-gateway"
        }
      + tags_all             = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-nat-gateway"
          + "Type"        = "Bot"
        }
    }

  # aws_nat_gateway.clash-bot-gateway[1] will be created
  + resource "aws_nat_gateway" "clash-bot-gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "clash-bot-discord-nat-gateway"
        }
      + tags_all             = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-nat-gateway"
          + "Type"        = "Bot"
        }
    }

  # aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.clash-bot-rt-private[0] will be created
  + resource "aws_route_table" "clash-bot-rt-private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "clash-bot-discord-rt"
        }
      + tags_all         = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-rt"
          + "Type"        = "Bot"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.clash-bot-rt-private[1] will be created
  + resource "aws_route_table" "clash-bot-rt-private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "clash-bot-discord-rt"
        }
      + tags_all         = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-rt"
          + "Type"        = "Bot"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.clash-bot-rta-private[0] will be created
  + resource "aws_route_table_association" "clash-bot-rta-private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.clash-bot-rta-private[1] will be created
  + resource "aws_route_table_association" "clash-bot-rta-private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_secretsmanager_secret.four will be created
  + resource "aws_secretsmanager_secret" "four" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (sensitive)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.one will be created
  + resource "aws_secretsmanager_secret" "one" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (sensitive)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.three will be created
  + resource "aws_secretsmanager_secret" "three" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (sensitive)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.two will be created
  + resource "aws_secretsmanager_secret" "two" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (sensitive)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Type"        = "Bot"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.four_version will be created
  + resource "aws_secretsmanager_secret_version" "four_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.one_version will be created
  + resource "aws_secretsmanager_secret_version" "one_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.three_version will be created
  + resource "aws_secretsmanager_secret_version" "three_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.two_version will be created
  + resource "aws_secretsmanager_secret_version" "two_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.clash-bot-discord-bot-sg will be created
  + resource "aws_security_group" "clash-bot-discord-bot-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "clash-bot-discord-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "clash-bot-discord-alb-sg"
        }
      + tags_all               = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-alb-sg"
          + "Type"        = "Bot"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.clash-bot-discord-bot-task-sg will be created
  + resource "aws_security_group" "clash-bot-discord-bot-task-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "clash-bot-discord-ecs-task-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "clash-bot-discord-ecs-task-sg"
        }
      + tags_all               = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-ecs-task-sg"
          + "Type"        = "Bot"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.clash-bot-subnet-private[0] will be created
  + resource "aws_subnet" "clash-bot-subnet-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.0.0/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "clash-bot-discord-0-private"
        }
      + tags_all                                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-0-private"
          + "Type"        = "Bot"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.clash-bot-subnet-private[1] will be created
  + resource "aws_subnet" "clash-bot-subnet-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.0.16/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "clash-bot-discord-1-private"
        }
      + tags_all                                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-1-private"
          + "Type"        = "Bot"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.clash-bot-subnet-public[0] will be created
  + resource "aws_subnet" "clash-bot-subnet-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.0.32/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "clash-bot-discord-0-public"
        }
      + tags_all                                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-0-public"
          + "Type"        = "Bot"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.clash-bot-subnet-public[1] will be created
  + resource "aws_subnet" "clash-bot-subnet-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.0.0.48/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "clash-bot-discord-1-public"
        }
      + tags_all                                       = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-1-public"
          + "Type"        = "Bot"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.clash-bot-vpc will be created
  + resource "aws_vpc" "clash-bot-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.0.0.0/20"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "clash-bot-discord-vpc"
        }
      + tags_all                             = {
          + "Application" = "Clash-Bot-Discord-Bot"
          + "Name"        = "clash-bot-discord-vpc"
          + "Type"        = "Bot"
        }
    }

Plan: 43 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs-name                = "clash-bot-discord-ecs"
  + task_definition_version = (known after apply)

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*